zeindica-app/app/views/premios/_form.html.erb

    <%= f.label :empresa_id %><br />
    <%= collection_select(:premio, :empresa_id, Empresa.all, :id, :nome, :prompt => 'Selecione uma empresa') %>
---
SELECT `empresas`.* FROM `empresas`