zeindica-app/app/controllers/authentications_controller.rb

	def create
  	auth = request.env["omniauth.auth"]

  	# Try to find authentication first
 		authentication = Authentication.find_by_provider_and_uid(auth['provider'], auth['uid'])

  	if authentication
    	# Authentication found, sign the usuario in.
    	flash[:notice] = "Signed in successfully."
    	sign_in_and_redirect(:usuario, authentication.usuario)
  	else
    	# Authentication not found, thus a new usuario.
    	usuario = Usuario.new
    	usuario.apply_omniauth(auth)
    	if usuario.save(:validate => false)
---
SELECT `authentications`.* FROM `authentications` WHERE `authentications`.`provider` = 'facebook' AND `authentications`.`uid` = '100002025472736' LIMIT 1
INSERT INTO `usuarios` (`admin`, `created_at`, `current_sign_in_at`, `current_sign_in_ip`, `email`, `facebook_link`, `last_sign_in_at`, `last_sign_in_ip`, `nome`, `sign_in_count`, `updated_at`) VALUES (0, '2012-12-17 10:37:04', NULL, NULL, 'luizaugusto3b@gmail.com', 'http://www.facebook.com/luizcosta.pqt', NULL, NULL, 'Luiz Costa', 0, '2012-12-17 10:37:04')