zeindica-app/app/controllers/cupons_controller.rb

SELECT `premios`.* FROM `premios` WHERE `premios`.`id` = 1 LIMIT 1
INSERT INTO `cupons` (`created_at`, `depositado`, `premiado`, `premio_id`, `updated_at`, `usuario_id`) VALUES ('2012-12-17 10:46:29', 0, 0, 1, '2012-12-17 10:46:29', 1)
---
	def create
		premio = Premio.find(session[:premio_id])

		@cupom_sorteado = Cupom.find_all_by_premio_id_and_premiado(premio.id, true)

		if usuario_signed_in? and @cupom_sorteado.empty?
    	@cupom = current_usuario.cupons.build(:premio => premio)
			if @cupom.save