zeindica-app/app/controllers/empresas_controller.rb

  def index
    @empresas = Empresa.all
---
SELECT `empresas`.* FROM `empresas`

  def show
    @empresa = Empresa.find(params[:id])
---
SELECT `empresas`.* FROM `empresas` WHERE `empresas`.`id` = 1 LIMIT 1

  def create
    @empresa = Empresa.new(params[:empresa])

    respond_to do |format|
      if @empresa.save
---
INSERT INTO `empresas` (`created_at`, `imagem_inferior_file_name`, `imagem_meio_file_name`, `imagem_topo_file_name`, `link_to_imagem_inferior`, `link_to_imagem_meio`, `link_to_imagem_topo`, `nome`, `telefone`, `updated_at`) VALUES ('2012-12-17 10:42:17', 'kosmos-bot.png', 'kosmos-mid.png', 'kosmos-top.png', '', '', '', 'Relógio', '', '2012-12-17 10:42:17')