zeindica-app/app/controllers/premios_controller.rb

	def main_page
		@premios = Premio.order('sorteio Desc').page(params[:page]).per((params[:page] == 2 ? 8 : 9))
---
SELECT COUNT(count_column) FROM (SELECT 1 AS count_column FROM `premios` LIMIT 9 OFFSET 9) subquery_for_count
SELECT `premios`.* FROM `premios` ORDER BY sorteio Desc LIMIT 9 OFFSET 0

  def index
    @premios = Premio.all
---
SELECT `premios`.* FROM `premios`

  def show
    @premio = Premio.find(params[:id])
---
SELECT `premios`.* FROM `premios` WHERE `premios`.`id` = 1 LIMIT 1

  def create
    @premio = Premio.new(params[:premio])

    respond_to do |format|
      if @premio.save
---
INSERT INTO `premios` (`created_at`, `descricao`, `empresa_id`, `imagem_info_file_name`, `imagem_nuvem_file_name`, `nome`, `sorteio`, `updated_at`) VALUES ('2012-12-17 10:44:19', '', 1, 'kosmos-main.png', 'kosmos-nuvem.png', 'Relogio', '2012-12-17', '2012-12-17 10:44:19')